experiments/2_vllm_0.19_Qwen3-8B/5_gateway_serve_gateway-timed/out.log
====== Terminal 1 ======
[26 Jun 2026] ~/Workspaces/tokenkaki/deploy/vllm ❯ VLLM_HOST=172.17.0.1 CUDA_DEVICE_ORDER=PCI_BUS_ID CUDA_VISIBLE_DEVICES=4 UV_TORCH_BACKEND=auto ./run-openai-server.sh

====== Terminal 2 ======
[26 Jun 2026] ~/Workspaces/tokenkaki ❯ TOKENKAKI_GATEWAY_PORT=18000 TOKENKAKI_PROMETHEUS_PORT=19090 docker compose -f deploy/compose/compose.yaml up --build

====== Terminal 3 ======
[26 Jun 2026] ~/Workspaces/tokenkaki ❯ BENCHMARK_TARGET=gateway \
                                        GATEWAY_BASE_URL=http://127.0.0.1:18000 \
                                        EXPERIMENT_ROOT=experiments/2_vllm_0.19_Qwen3-8B \
                                        RESULT_DIR=experiments/2_vllm_0.19_Qwen3-8B/5_gateway_serve_gateway-timed \
                                        NUM_PROMPTS=100 \
                                        REQUEST_RATE=5 \
                                        RANDOM_INPUT_LEN=128 \
                                        RANDOM_OUTPUT_LEN=64 \
                                        RESULT_FILENAME=vllm-gateway-serving-qwen3-8b-a100-gateway-timed.json \
                                        ./benchmarks/vllm-serving-bench.sh
Script started on 2026-06-26 15:41:13+08:00 [TERM="dumb" TTY="/dev/pts/79" COLUMNS="80" LINES="24"]
Running vLLM serving benchmark
  target: gateway
  benchmark path: gateway
  base URL: http://127.0.0.1:18000
  served model name: qwen3-8b
  public model: qwen3-8b
  backend model: Qwen/Qwen3-8B
  tokenizer model: Qwen/Qwen3-8B
  experiment root: /home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B
  num prompts: 100
  request rate: 5
  random input/output tokens: 128/64
  uv torch backend: auto
  result: /home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B/5_gateway_serve_gateway-timed/vllm-gateway-serving-qwen3-8b-a100-gateway-timed.json
WARNING 06-26 15:41:15 [cuda.py:618] Detected different devices in the system: NVIDIA A100-SXM4-40GB, NVIDIA A100-SXM4-40GB, NVIDIA A100-SXM4-40GB, NVIDIA DGX Display, NVIDIA A100-SXM4-40GB. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0d0f5449a0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:18000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['benchmark_target=gateway', 'benchmark_path=gateway', 'base_url=http://127.0.0.1:18000', 'gateway_base_url=http://127.0.0.1:18000', 'vllm_base_url=http://172.17.0.1:8001', 'public_model=qwen3-8b', 'backend_model=Qwen/Qwen3-8B', 'served_model_name=qwen3-8b', 'tokenizer_model=Qwen/Qwen3-8B', 'experiment_root=/home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B', 'uv_torch_backend=auto', 'benchmark_runner=same-host'], result_dir='/home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B/5_gateway_serve_gateway-timed', result_filename='vllm-gateway-serving-qwen3-8b-a100-gateway-timed.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-363c6e12-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3-8b', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 06-26 15:41:23 [datasets.py:700] Sampling input_len from [128, 128] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|█████████████████████████████████████████| 100/100 [00:20<00:00,  4.78it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  20.94     
Total input tokens:                      12800     
Total generated tokens:                  6400      
Request throughput (req/s):              4.78      
Output token throughput (tok/s):         305.61    
Peak output token throughput (tok/s):    652.00    
Peak concurrent requests:                17.00     
Total token throughput (tok/s):          916.82    
---------------Time to First Token----------------
Mean TTFT (ms):                          87.75     
Median TTFT (ms):                        78.34     
P99 TTFT (ms):                           165.79    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.72     
Median TPOT (ms):                        13.69     
P99 TPOT (ms):                           14.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.50     
Median ITL (ms):                         13.21     
P99 ITL (ms):                            37.85     
==================================================

Script done on 2026-06-26 15:41:44+08:00 [COMMAND_EXIT_CODE="0"]